app/views/articles/index.html.erb


Our blog has <%= Article.count %> articles and counting!
---
SELECT "articles".* FROM "articles"
SELECT COUNT(*) FROM "articles"