app/controllers/comments_controller.rb

    def index
      @article = Article.find(params[:article_id])
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]